test_performance.log
$ ab -n 500 -c 100 -t 30 http://localhost/projects/media-server-php/IMAGEM-800-600.jpg

This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        Apache/2.2.20
Server Hostname:        localhost
Server Port:            80

Document Path:          /projects/media-server-php/IMAGEM-800-600.jpg
Document Length:        0 bytes

Concurrency Level:      100
Time taken for tests:   34.415 seconds
Complete requests:      381
Failed requests:        376
   (Connect: 0, Receive: 0, Length: 376, Exceptions: 0)
Write errors:           0
Total transferred:      16267728 bytes
HTML transferred:       16148696 bytes
Requests per second:    11.07 [#/sec] (mean)
Time per request:       9032.854 [ms] (mean)
Time per request:       90.329 [ms] (mean, across all concurrent requests)
Transfer rate:          461.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3 4752 2357.6   5916    6512
Processing:     0 1399 3082.7     34    9954
Waiting:        0 1315 3055.0      0    9794
Total:       3709 6151 1523.5   6120    9958

Percentage of the requests served within a certain time (ms)
  50%   6120
  66%   6320
  75%   6350
  80%   6366
  90%   9798
  95%   9947
  98%   9951
  99%   9957
 100%   9958 (longest request)